# AllowsBoundParameters Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Category..::..AllowsBoundParameters Property
Category Class See Also
---
To check if the category can have project parameters.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public bool AllowsBoundParameters { get; }
```

Visual Basic
---
```text
Public ReadOnly Property AllowsBoundParameters As Boolean
	Get
```

Visual C++
---
```text
public:
property bool AllowsBoundParameters {
	bool get ();
}
```

# See Also
Category Class
Autodesk.Revit.DB Namespace